Tekla.Structures.Geometry3d.BoxConversions
The Tekla.Structures.Geometry3d.BoxConversions class converts values representing boxes.

Tekla.Structures.Geometry3d.BoxConversions.ToAxisAlignedBox3(Tekla.Structures.Geometry3d.AABB)
Converts an Tekla.Structures.Geometry3d.AABB to an Tekla.Common.Geometry.AxisAlignedBox3.
axisAlignedBoundingBox: The Tekla.Structures.Geometry3d.AABB to convert.
Returns: The resulting Tekla.Common.Geometry.AxisAlignedBox3.

Tekla.Structures.Geometry3d.BoxConversions.ToBox3(Tekla.Structures.Geometry3d.OBB)
Converts an Tekla.Structures.Geometry3d.OBB to a Tekla.Common.Geometry.Box3.
boundingBox: The Tekla.Structures.Geometry3d.OBB to convert.
Returns: The resulting Tekla.Common.Geometry.Box3.

Tekla.Structures.Geometry3d.BoxConversions.ToAABB(Tekla.Common.Geometry.AxisAlignedBox3)
Converts an Tekla.Common.Geometry.AxisAlignedBox3 to an Tekla.Structures.Geometry3d.AABB.
axisAlignedBox: The Tekla.Common.Geometry.AxisAlignedBox3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.AABB.

Tekla.Structures.Geometry3d.BoxConversions.ToOBB(Tekla.Common.Geometry.Box3)
Converts a Tekla.Common.Geometry.Box3 to an Tekla.Structures.Geometry3d.OBB.
box: The Tekla.Common.Geometry.Box3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.OBB.